Revit 2024 API
FilledRegion.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, IList<CurveLoop>)
 Creates a view-specific filled region from the given boundaries.
Create(Document, ElementId, SketchPlane, IList<CurveLoop>)
 Creates a filled region on a sketch plane in a 3d model family.
See Also
FilledRegion Class
FilledRegion Members
Autodesk.Revit.DB Namespace